<a href="https://colab.research.google.com/github/joohoshin/Python_Basic/blob/master/12_3_%EC%97%B0%EC%82%B0%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas 연산
* assign() 함수를 사용하여 쉽게 연산할 수 있습니다. 
* 성적예제를 활용하여 연산을 해봅시다

In [ ]:
from google.colab import drive
drive.mount('/g')

Mounted at /g

In [ ]:
import pandas as pd

# 지난 강의에서 만든 성적데이터를 불러와 봅시다
grade = pd.read_csv('/g/My Drive/Python_202002/grade.csv',index_col = 'id', encoding='cp949') # 인덱스 컬럼 지정

In [ ]:
grade.head()

       공창컴  화학  영어
id
13019   73  61  47
10241   92  61  97
13119   93  89  95
15565   90  56  51
11138   80  93  70

In [ ]:
grade.columns

Index(['공창컴', '화학', '영어'], dtype='object')

* 컬럼 이름을 바꿔봅시다

In [ ]:
grade.columns = ['퀴즈', '중간고사', '기말고사']

In [ ]:
grade.head()

       퀴즈  중간고사  기말고사
id
13019  73    61    47
10241  92    61    97
13119  93    89    95
15565  90    56    51
11138  80    93    70

* 퀴즈 20% 중간 30% 기말 50% 의 비중으로 성적 합계를 계산하는 것으로 가정합시다
* assign() 함수에 식을 적을 수 있습니다 .
* df['column']은 df.column과 같습니다.

In [ ]:
grade = grade.assign(합계 = grade.퀴즈 * 0.2 + grade.중간고사 * 0.3 + grade.기말고사 * 0.5)

In [ ]:
grade.head()

       퀴즈  중간고사  기말고사    합계
id
13019  73    61    47  56.4
10241  92    61    97  85.2
13119  93    89    95  92.8
15565  90    56    51  60.3
11138  80    93    70  78.9

In [ ]:
grade['합계2'] = grade.퀴즈 * 0.2 + grade.중간고사 * 0.3 + grade.기말고사 * 0.5

In [ ]:
grade

       퀴즈  중간고사  기말고사    합계   합계2
id
13019  73    61    47  56.4  56.4
10241  92    61    97  85.2  85.2
13119  93    89    95  92.8  92.8
15565  90    56    51  60.3  60.3
11138  80    93    70  78.9  78.9
...    ..   ...   ...   ...   ...
13988  99    63    89  83.2  83.2
10880  72    67    70  69.5  69.5
17470  70    79    40  57.7  57.7
15573  92    50    97  81.9  81.9
18138  84    77    75  77.4  77.4

[100 rows x 5 columns]

* 성적순으로 정렬해봅시다. 
* sort_values() 함수를 사용합니다

In [ ]:
grade_sort = grade.sort_values('합계', ascending = False)

In [ ]:
grade_sort.head(10)

       퀴즈  중간고사  기말고사    합계   합계2
id
15907  90   100    99  97.5  97.5
13155  95    85    99  94.0  94.0
13119  93    89    95  92.8  92.8
12757  73    92   100  92.2  92.2
16071  71    90    99  90.7  90.7
10927  90    85    94  90.5  90.5
12793  92    85    93  90.4  90.4
10715  95    67   100  89.1  89.1
17913  87    93    87  88.8  88.8
18461  96    83    88  88.1  88.1

* 특정 컬럼만 선택하기
* filter() 함수를 사용합니다

In [ ]:
grade_final = grade_sort.filter(['기말고사','합계'])

In [ ]:
grade_final.head()

       기말고사    합계
id
15907    99  97.5
13155    99  94.0
13119    95  92.8
12757   100  92.2
16071    99  90.7